/* Best high score label */
"Best" = "Migliore";

/* GOING FASTER Label */
"GOING FASTER" = "Andare Più Veloce";

/* Labyrinth Tilt Maze */
"Labyrinth Tilt Maze" = "Labyrinth Tilt Maze";

/* LeaderBoard */
"LeaderBoard" = "Tab. Punteggi";

/* More */
"More" = "di più";

/* OTHER GAMES BY */
"OTHER GAMES BY" = "ALTRI GIOCHI DI";

/* RATE IT */
"RATE IT" = "Votarla";

/* SHARE */
"SHARE" = "Compartecipazione";

/* Sonic Racer */
"Sonic Racer" = "Sonico Pilota";

/* STAGE Label
   STAGE label */
"STAGE" = "FASE";

/* swipe to move label */
"swipe to move" = "strisciare per muoversi";

/* TAP TO START */
"TAP TO START" = "Toccare Per Avviare";

/* YOUR SCORE label */
"YOUR SCORE" = "IL PUNTEGGIO";

